#pragma once
#define upperBound 100 // Вверхняя граница для генерации случайных чисел
#define lowerBound -100 // Нижняя граница для генерации случайных чисел
#define maxSize 1000 // Наибольший размер массива

int inputInt(); // Проверка ввода на соответствие целочисленному типу

unsigned long inputUnsignedLong(); // Проверка ввода на соответствие целочисленному беззнаковому типу

double inputDouble(); // Проверка ввода на соответствие типу с плавающей запятой

bool inputBool(); // Проверка ввода на соответствие логическому типу

